app/views/books/index.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
---
              <% if current_user.favpost?(book) %>
              <%= form_for(current_user.favorites.find_by(book_id: book.id), html: { method: :delete }) do |f| %>