app/views/books/show.html.erb

<div class="line-bc">
  <% @book.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]