app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (title LIKE '%山%')
---
    def index
        @books = Book.all

INSERT INTO "books" ("user_id", "title", "opinion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "山の幸"], ["opinion", "test"], ["created_at", "2019-06-04 07:43:01.271270"], ["updated_at", "2019-06-04 07:43:01.271270"]]
---
    def create
        @books = Book.all
    	@book = Book.new(book_params)
        @user = current_user
        @book.user_id = current_user.id
    	if @book.save