app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites"
---
  def index
  	@favorites = Favorite.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2019-06-05 15:07:04.461272"], ["updated_at", "2019-06-05 15:07:04.461272"]]
---
  def create
  	user=current_user
  	book = Book.find(params[:book_id])
    Favorite.create(user_id: user.id,book_id:book.id)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 6]]
---
  def destroy
  	user=current_user
  	book = Book.find(params[:book_id])
    favorite=Favorite.find_by(user_id: user.id,book_id:book.id)
      favorite.delete