app/controllers/post_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["user_id", 1], ["book_id", 1], ["created_at", "2019-06-04 08:13:16.545980"], ["updated_at", "2019-06-04 08:13:16.545980"]]
---
	def create
		book = Book.find(params[:book_id])
	    comment = current_user.post_comments.new(post_comment_params)
	    comment.book_id = book.id
	    comment.save