app/controllers/users_controller.rb

  def show
  	 @user = User.find(params[:id])
  	 @book = Book.new
     @books_user = Book.where(user_id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]