app/models/user.rb

INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2019-06-05 06:03:56.804101"], ["updated_at", "2019-06-05 06:03:56.804101"]]
---
  def like(book)
    favorites.find_or_create_by(book_id: book.id)

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def unlike(book)
    favorite = favorites.find_by(book_id: book.id)
    favorite.destroy if favorite